In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
s1 = Series(np.arange(100,500,100))
s1

0    100
1    200
2    300
3    400
dtype: int32

In [4]:
s2 = Series(np.arange(500,1000,100))
s2

0    500
1    600
2    700
3    800
4    900
dtype: int32

In [5]:
s1 + s2

0     600.0
1     800.0
2    1000.0
3    1200.0
4       NaN
dtype: float64

In [10]:
df1 = DataFrame(np.arange(9).reshape(3,3))
df1

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

In [11]:
df2 = DataFrame(np.arange(25).reshape(5,5))
df2

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [12]:
df1+df2

      0     1     2   3   4
0   0.0   2.0   4.0 NaN NaN
1   8.0  10.0  12.0 NaN NaN
2  16.0  18.0  20.0 NaN NaN
3   NaN   NaN   NaN NaN NaN
4   NaN   NaN   NaN NaN NaN

In [14]:
df1 = df1.add(df2)
df1

      0     1     2   3   4
0   0.0   3.0   6.0 NaN NaN
1  13.0  16.0  19.0 NaN NaN
2  26.0  29.0  32.0 NaN NaN
3   NaN   NaN   NaN NaN NaN
4   NaN   NaN   NaN NaN NaN

In [15]:
df1 = df1.add(df2, fill_value=0)
df1

      0     1     2     3     4
0   0.0   4.0   8.0   3.0   4.0
1  18.0  22.0  26.0   8.0   9.0
2  36.0  40.0  44.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0
4  20.0  21.0  22.0  23.0  24.0

In [16]:
#subtract a series from DF

In [19]:
ser = df1.loc[1]
ser

0    18.0
1    22.0
2    26.0
3     8.0
4     9.0
Name: 1, dtype: float64

In [20]:
df1 - ser

      0     1     2     3     4
0 -18.0 -18.0 -18.0  -5.0  -5.0
1   0.0   0.0   0.0   0.0   0.0
2  18.0  18.0  18.0   5.0   5.0
3  -3.0  -6.0  -9.0  10.0  10.0
4   2.0  -1.0  -4.0  15.0  15.0